liquidraver/MeshCore/src/helpers/nrf52/SerialBLEInterface.cpp
#include "SerialBLEInterface.h"
#include <string.h>
#include "ble_gap.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "nrf_error.h"

static SerialBLEInterface* instance;

// Validates connection handle using SoftDevice API
// Queries connection security state to verify handle is still active
static bool isValidConnectionHandleSD(uint16_t conn_handle) {
  if (conn_handle == BLE_CONN_HANDLE_INVALID || conn_handle == 0xFFFF) {
    return false;
  }
  
  // Query connection security state - returns BLE_ERROR_INVALID_CONN_HANDLE if handle is invalid
  ble_gap_conn_sec_t conn_sec;
  uint32_t err = sd_ble_gap_conn_sec_get(conn_handle, &conn_sec);
  return (err == NRF_SUCCESS);
}

// Callback invoked when BLE connection is established
// Updates connection handle and resets state for new connection
void SerialBLEInterface::onConnect(uint16_t connection_handle) {
  BLE_DEBUG_PRINTLN("SerialBLEInterface: connected handle=0x%04X", connection_handle);
  if (instance) {
    if (instance->isConnectionHandleValid() && instance->_connectionHandle != connection_handle) {
      BLE_DEBUG_PRINTLN("WARN: New connection with different handle! Old=0x%04X, New=0x%04X", 
                       instance->_connectionHandle, connection_handle);
      Bluefruit.disconnect(instance->_connectionHandle);
    }
    instance->_connectionHandle = connection_handle;
    instance->_isDeviceConnected = false;
    instance->_pending_writes = 0;
    instance->_disconnect_waiting_tx_drain = false;
    instance->_tx_drain_wait_start = 0;
    instance->clearBuffers();
  }
}

// Callback invoked when BLE connection is terminated
// Clears connection state and drains remaining RX buffer data
void SerialBLEInterface::onDisconnect(uint16_t connection_handle, uint8_t reason) {
  BLE_DEBUG_PRINTLN("SerialBLEInterface: disconnected handle=0x%04X reason=%d", connection_handle, reason);
  if(instance){
    if (instance->isConnectionHandleValid() && instance->_connectionHandle != connection_handle) {
      BLE_DEBUG_PRINTLN("WARN: Disconnect event for wrong handle! Stored=0x%04X, Event=0x%04X", 
                       instance->_connectionHandle, connection_handle);
      return;
    }
    instance->_isDeviceConnected = false;
    instance->_connectionHandle = 0xFFFF;
    instance->_pending_writes = 0;
    instance->send_queue_len = 0;
    // Reset write failure tracking and disconnect state
    instance->_write_retry_count = 0;
    instance->_first_write_failure_time = 0;
    instance->_last_disconnect_time = millis();
    instance->_disconnect_pending = false;
    instance->_disconnect_initiated_time = 0;
    instance->_disconnect_waiting_tx_drain = false;
    instance->_tx_drain_wait_start = 0;
    
    // Drain any remaining data in BLE UART RX buffer to start with clean slate
    uint8_t discard[32];
    int drained_total = 0;
    while (instance->bleuart.available() > 0) {
      int chunk = instance->bleuart.available() < (int)sizeof(discard) ? instance->bleuart.available() : (int)sizeof(discard);
      int drained = instance->bleuart.readBytes(discard, chunk);
      if (drained <= 0) break;
      drained_total += drained;
    }
    if (drained_total > 0) {
      BLE_DEBUG_PRINTLN("Drained %d bytes from BLE RX buffer on disconnect", drained_total);
    }
  }
}

// Callback invoked when BLE connection security is established
// Validates connection handle and marks device as fully connected
void SerialBLEInterface::onSecured(uint16_t connection_handle) {
  BLE_DEBUG_PRINTLN("SerialBLEInterface: onSecured handle=0x%04X", connection_handle);
  if(instance){
    if (!instance->isConnectionHandleValid() || instance->_connectionHandle != connection_handle) {
      BLE_DEBUG_PRINTLN("WARN: onSecured with mismatched handle! Stored=0x%04X, Event=0x%04X", 
                       instance->_connectionHandle, connection_handle);
      return;
    }
    // Validate connection handle before setting state
    if (isValidConnectionHandleSD(connection_handle)) {
      instance->_isDeviceConnected = true;
      // Reset write failure tracking on new secure connection
      instance->_write_retry_count = 0;
      instance->_first_write_failure_time = 0;
      instance->_disconnect_pending = false;
      instance->_disconnect_initiated_time = 0;
      instance->_disconnect_waiting_tx_drain = false;
      instance->_tx_drain_wait_start = 0;
    } else {
      BLE_DEBUG_PRINTLN("SerialBLEInterface: onSecured with invalid handle=%d", connection_handle);
      instance->_isDeviceConnected = false;
    }
  }
}

// Callback for BLE pairing passkey display/verification
// Returns true to accept pairing request
bool SerialBLEInterface::onPairingPasskey(uint16_t connection_handle, uint8_t const passkey[6], bool match_request) {
  BLE_DEBUG_PRINTLN("SerialBLEInterface: pairing passkey request match=%d", match_request);
  (void)connection_handle;
  (void)passkey;
  return true;
}

// Callback invoked when BLE pairing process completes
// Disconnects if pairing failed, otherwise connection proceeds to secured state
void SerialBLEInterface::onPairingComplete(uint16_t connection_handle, uint8_t auth_status) {
  BLE_DEBUG_PRINTLN("SerialBLEInterface: pairing complete status=%d", auth_status);
  if (auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
    BLE_DEBUG_PRINTLN("SerialBLEInterface: pairing successful");
  } else {
    BLE_DEBUG_PRINTLN("SerialBLEInterface: pairing failed, disconnecting");
    if (instance && instance->isConnectionHandleValid()) {
      Bluefruit.disconnect(connection_handle);
    }
  }
}

// Central BLE event handler for GAP and GATTS events
// Processes connection parameter updates, PHY updates, data length updates, and TX completion
void SerialBLEInterface::onBLEEvent(ble_evt_t* evt) {
  if (!instance) return;
  uint16_t conn_handle = 0xFFFF;
  if (evt->header.evt_id >= BLE_GAP_EVT_BASE && evt->header.evt_id <= BLE_GAP_EVT_LAST) {
    conn_handle = evt->evt.gap_evt.conn_handle;
  } else if (evt->header.evt_id >= BLE_GATTS_EVT_BASE && evt->header.evt_id <= BLE_GATTS_EVT_LAST) {
    conn_handle = evt->evt.gatts_evt.conn_handle;
  }

  switch(evt->header.evt_id) {
    case BLE_GAP_EVT_DISCONNECTED:
      // Disconnect is handled by onDisconnect callback, but we catch it here to avoid "unhandled" log
      // The handle may be 0x0000 for advertising-related disconnects
      break;

    case BLE_GAP_EVT_SEC_INFO_REQUEST:
      // Security info request is handled by Bluefruit Security callbacks, but we catch it here to avoid "unhandled" log
      // The handle may be 0x0000 for advertising-related events
      break;

