liquidraver/MeshCore/src/helpers/nrf52/SerialBLEInterface.cpp
    case BLE_GAP_EVT_CONN_SEC_UPDATE:
      // Connection security update is handled by onSecured callback, but we catch it here to avoid "unhandled" log
      // The handle may be 0x0000 for advertising-related events
      break;

    case BLE_GATTS_EVT_HVN_TX_COMPLETE:
      if (instance->_pending_writes > 0) {
        uint8_t completed = evt->evt.gatts_evt.params.hvn_tx_complete.count;
        if (instance->_pending_writes >= completed) {
          instance->_pending_writes -= completed;
        } else {
          instance->_pending_writes = 0;
        }
        BLE_DEBUG_PRINTLN("TX complete: %d, pending now: %d", completed, instance->_pending_writes);
      }
      break;

    case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
      BLE_DEBUG_PRINTLN("CONN_PARAM_UPDATE_REQUEST: handle=0x%04X, min_interval=%d, max_interval=%d, latency=%d, timeout=%d",
                       conn_handle,
                       evt->evt.gap_evt.params.conn_param_update_request.conn_params.min_conn_interval,
                       evt->evt.gap_evt.params.conn_param_update_request.conn_params.max_conn_interval,
                       evt->evt.gap_evt.params.conn_param_update_request.conn_params.slave_latency,
                       evt->evt.gap_evt.params.conn_param_update_request.conn_params.conn_sup_timeout);
      
      if (!instance->isConnectionHandleValid() || instance->_connectionHandle != conn_handle) {
        BLE_DEBUG_PRINTLN("WARN: CONN_PARAM_UPDATE_REQUEST with mismatched handle! Stored=0x%04X, Event=0x%04X",
                         instance->_connectionHandle, conn_handle);
        return;
      }
      
      uint32_t err_code = sd_ble_gap_conn_param_update(conn_handle, NULL);
      if (err_code == NRF_SUCCESS) {
        BLE_DEBUG_PRINTLN("Accepted CONN_PARAM_UPDATE_REQUEST (using PPCP)");
      } else {
        BLE_DEBUG_PRINTLN("ERROR: Failed to accept CONN_PARAM_UPDATE_REQUEST: 0x%08X", err_code);
      }
      break;
    }

    case BLE_GAP_EVT_CONN_PARAM_UPDATE:
      BLE_DEBUG_PRINTLN("CONN_PARAM_UPDATE: handle=0x%04X, min_interval=%d, max_interval=%d, latency=%d, timeout=%d",
                       conn_handle,
                       evt->evt.gap_evt.params.conn_param_update.conn_params.min_conn_interval,
                       evt->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval,
                       evt->evt.gap_evt.params.conn_param_update.conn_params.slave_latency,
                       evt->evt.gap_evt.params.conn_param_update.conn_params.conn_sup_timeout);
      break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
      BLE_DEBUG_PRINTLN("PHY_UPDATE_REQUEST: handle=0x%04X, tx_phys=0x%02X, rx_phys=0x%02X",
                       conn_handle,
                       evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.tx_phys,
                       evt->evt.gap_evt.params.phy_update_request.peer_preferred_phys.rx_phys);
      
      if (!instance->isConnectionHandleValid() || instance->_connectionHandle != conn_handle) {
        BLE_DEBUG_PRINTLN("WARN: PHY_UPDATE_REQUEST with mismatched handle! Stored=0x%04X, Event=0x%04X",
                         instance->_connectionHandle, conn_handle);
        return;
      }
      
      ble_gap_phys_t phy_params = { BLE_GAP_PHY_AUTO, BLE_GAP_PHY_AUTO };
      uint32_t err_code = sd_ble_gap_phy_update(conn_handle, &phy_params);
      if (err_code == NRF_SUCCESS) {
        BLE_DEBUG_PRINTLN("Accepted PHY_UPDATE_REQUEST (AUTO)");
      } else {
        BLE_DEBUG_PRINTLN("ERROR: Failed to accept PHY_UPDATE_REQUEST: 0x%08X", err_code);
      }
      break;
    }

    case BLE_GAP_EVT_PHY_UPDATE:
      BLE_DEBUG_PRINTLN("PHY_UPDATE: handle=0x%04X, status=0x%02X, tx_phy=0x%02X, rx_phy=0x%02X",
                       conn_handle,
                       evt->evt.gap_evt.params.phy_update.status,
                       evt->evt.gap_evt.params.phy_update.tx_phy,
                       evt->evt.gap_evt.params.phy_update.rx_phy);
      break;

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
      BLE_DEBUG_PRINTLN("DATA_LENGTH_UPDATE_REQUEST: handle=0x%04X, max_tx_octets=%d, max_tx_time_us=%d, max_rx_octets=%d, max_rx_time_us=%d",
                       conn_handle,
                       evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets,
                       evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_time_us,
                       evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_octets,
                       evt->evt.gap_evt.params.data_length_update_request.peer_params.max_rx_time_us);
      
      if (!instance->isConnectionHandleValid() || instance->_connectionHandle != conn_handle) {
        BLE_DEBUG_PRINTLN("WARN: DATA_LENGTH_UPDATE_REQUEST with mismatched handle! Stored=0x%04X, Event=0x%04X",
                         instance->_connectionHandle, conn_handle);
        return;
      }
      
      uint32_t err_code = sd_ble_gap_data_length_update(conn_handle, NULL, NULL);
      if (err_code == NRF_SUCCESS) {
        BLE_DEBUG_PRINTLN("Accepted DATA_LENGTH_UPDATE_REQUEST (AUTO)");
      } else {
        BLE_DEBUG_PRINTLN("ERROR: Failed to accept DATA_LENGTH_UPDATE_REQUEST: 0x%08X", err_code);
      }
      break;
    }

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
      BLE_DEBUG_PRINTLN("DATA_LENGTH_UPDATE: handle=0x%04X, max_tx_octets=%d, max_tx_time_us=%d, max_rx_octets=%d, max_rx_time_us=%d",
                       conn_handle,
                       evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
                       evt->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us,
                       evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                       evt->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us);
      break;

    case BLE_GAP_EVT_TIMEOUT:
      BLE_DEBUG_PRINTLN("GAP_TIMEOUT: handle=0x%04X, src=0x%02X",
                       conn_handle,
                       evt->evt.gap_evt.params.timeout.src);
      break;

    case BLE_GATTS_EVT_TIMEOUT:
      BLE_DEBUG_PRINTLN("GATTS_TIMEOUT: handle=0x%04X, src=0x%02X",
                       conn_handle,
                       evt->evt.gatts_evt.params.timeout.src);
      break;

    default:
      #ifdef BLE_DEBUG_LOGGING
      if (evt->header.evt_id >= BLE_GAP_EVT_BASE && evt->header.evt_id <= BLE_GAP_EVT_LAST) {
        BLE_DEBUG_PRINTLN("Unhandled GAP event: 0x%02X handle=0x%04X", evt->header.evt_id, conn_handle);
      }
      #endif
      break;
  }
}

// Initialize BLE stack with device name and PIN code
// Configures security, advertising, and registers all callbacks
void SerialBLEInterface::begin(const char* device_name, uint32_t pin_code) {

