liquidraver/MeshCore/src/helpers/nrf52/SerialBLEInterface.cpp
        // Re-check connection validity after failed write using SoftDevice API
        // Only do expensive validation after failures, not before every write
        bool still_valid = _isDeviceConnected && 
                          isConnectionHandleValid() && 
                          bleuart.notifyEnabled(_connectionHandle);
        
        if (still_valid) {
          // Validate connection handle using SoftDevice API to detect stale handles
          if (!isValidConnectionHandleSD(_connectionHandle)) {
            BLE_DEBUG_PRINTLN("Connection handle invalid after write failure");
            still_valid = false;
          }
        }
        
        // Check if we've been failing for too long - force disconnect to recover
        bool failure_timeout = (_first_write_failure_time > 0) && 
                              (millis() - _first_write_failure_time >= MAX_WRITE_FAILURE_DURATION);
        
        // Drop frame after max retries, if connection is invalid, or if failures persist too long
        if (_write_retry_count >= MAX_WRITE_RETRIES || !still_valid || failure_timeout) {
          if (failure_timeout) {
            BLE_DEBUG_PRINTLN("Write failures persisted for %d ms, forcing disconnect", 
                             (uint32_t)(millis() - _first_write_failure_time));
            // Force disconnect to recover from bad connection state
            // Check rate limiting - prevent rapid disconnect/reconnect cycles
            unsigned long time_since_last_disconnect = millis() - _last_disconnect_time;
            if (time_since_last_disconnect < MIN_DISCONNECT_INTERVAL) {
              BLE_DEBUG_PRINTLN("Disconnect rate limited - waiting %d ms", 
                               (uint32_t)(MIN_DISCONNECT_INTERVAL - time_since_last_disconnect));
              // Don't disconnect yet, but clear state to prevent further writes
              _isDeviceConnected = false;
            } else if (isConnectionHandleValid()) {
              // Check if TX queue is empty before forcing disconnect
              // This prevents crashes when disconnecting with pending operations
              if (_pending_writes > 0 && !_disconnect_waiting_tx_drain) {
                // TX queue not empty - wait for it to drain first
                BLE_DEBUG_PRINTLN("TX queue not empty (pending=%d), waiting for drain before disconnect", _pending_writes);
                _disconnect_waiting_tx_drain = true;
                _tx_drain_wait_start = millis();
                // Don't disconnect yet - will be handled in next checkRecvFrame() call
              } else if (_pending_writes == 0 || (_disconnect_waiting_tx_drain && _tx_drain_wait_start > 0 && 
                         (millis() - _tx_drain_wait_start >= TX_QUEUE_DRAIN_TIMEOUT || _pending_writes == 0))) {
                // TX queue is empty or timeout expired - safe to disconnect
                // Clear wait flags since we're proceeding with disconnect
                _disconnect_waiting_tx_drain = false;
                _tx_drain_wait_start = 0;
                // Use SoftDevice API directly to get error codes
                uint32_t err = sd_ble_gap_disconnect(_connectionHandle, BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION);
                if (err == NRF_SUCCESS) {
                  _disconnect_initiated_time = millis();
                  _disconnect_pending = true;
                  BLE_DEBUG_PRINTLN("Disconnect initiated, waiting for event");
                } else if (err == NRF_ERROR_NO_MEM) {
                  BLE_DEBUG_PRINTLN("NRF_ERROR_NO_MEM - SoftDevice out of memory, clearing state");
                  // SoftDevice is out of memory - force complete state reset
                  _isDeviceConnected = false;
                  _connectionHandle = 0xFFFF;
                  _disconnect_pending = false;
                  _disconnect_initiated_time = 0;
                  _last_disconnect_time = millis();
                  send_queue_len = 0;  // Clear send queue
                  _pending_writes = 0;  // Clear pending writes
                  _write_retry_count = 0;
                  _first_write_failure_time = 0;
                } else {
                  BLE_DEBUG_PRINTLN("Disconnect failed with error: 0x%08X", (uint32_t)err);
                  // Disconnect failed, but clear state anyway
                  _isDeviceConnected = false;
                  _connectionHandle = 0xFFFF;
                }
              } else {
                // Still waiting for TX queue to drain - will retry on next checkRecvFrame() call
                // Don't proceed with disconnect yet
              }
            } else {
              // Invalid handle, just clear state
              _isDeviceConnected = false;
              _connectionHandle = 0xFFFF;
            }
          }
          
          BLE_DEBUG_PRINTLN("Dropping frame after %d failed write attempts (connection_valid=%d, timeout=%d)", 
                           _write_retry_count, still_valid, failure_timeout);
          _write_retry_count = 0;
          _first_write_failure_time = 0;
          send_queue_len--;
          for (int i = 0; i < send_queue_len; i++) {
            send_queue[i] = send_queue[i + 1];
          }
          
          // If connection is invalid, clear connection state
          if (!still_valid || failure_timeout) {
            BLE_DEBUG_PRINTLN("Connection invalid, clearing state");
            _isDeviceConnected = false;
            _connectionHandle = 0xFFFF;
          }
        }
      }
    }
  } else {
    if (_isDeviceConnected) {
      int avail = bleuart.available();
      if (avail > 0) {
        int got = bleuart.readBytes(dest, avail > MAX_FRAME_SIZE ? MAX_FRAME_SIZE : avail);

        if (avail > MAX_FRAME_SIZE) {
          uint8_t discard[32];
          int remaining = avail - got;
          while (remaining > 0) {
            int chunk = remaining < (int)sizeof(discard) ? remaining : (int)sizeof(discard);
            int drained = bleuart.readBytes(discard, chunk);
            if (drained <= 0) break;
            remaining -= drained;
          }
          BLE_DEBUG_PRINTLN("WARN: BLE RX overflow: avail=%d, read=%d, drained=%d", avail, got, avail - got - remaining);
        }

        BLE_DEBUG_PRINTLN("readBytes: sz=%d, hdr=%d", got, (uint32_t) dest[0]);
        return got;
      }
    }
  }
  return 0;
}

// Check if device is connected by verifying connection handle and Bluefruit connection state
bool SerialBLEInterface::isConnected() const {
  if (!_isDeviceConnected) return false;
  if (isConnectionHandleValid()) {
    return Bluefruit.connected(_connectionHandle);
  }
  return false;
}
